{
    "publications": [
        {
            "link": "https://inria.hal.science/hal-04152604v1/document",
            "distinction": {
                "link": "https://pfia23.icube.unistra.fr/conferences/ic/index.html%3Fp=prix.html",
                "type": "Prix mis en lumière"
            },
            "title": "Un cadre pour inclure et exploiter des informations probabilistes dans les rapports de validation SHACL",
            "authors": [
                "Rémi Felin",
                "Catherine Faron",
                "Andrea G. B. Tettamanzi"
            ],
            "keywords": [
                "RDF",
                "SHACL",
                "Data Validation",
                "Probabilistic Assessment"
            ],
            "conferenceTitle": "IC 'Ingénierie des Connaissances'",
            "date": 2023,
            "place": "Strasbourg, France",
            "abstract": "SHACL est une recommandation du W3C qui permet de représenter en RDF des contraintes appelées formes (shapes en anglais) et de valider des graphes de données RDF par rapport à ces contraintes. Un validateur SHACL produit un résultat booléen, faux pour une forme SHACL quand au moins un triple dans le graphe RDF n'est pas conforme à la forme, vrai sinon. Nous proposons un cadre probabiliste pour valider un graphe RDF avec une proportion réaliste de triplets qui ne se conforment pas à une shape.",
            "citation": "Rémi Felin, Catherine Faron, Andrea G B Tettamanzi. Un cadre pour inclure et exploiter des informations probabilistes dans les rapports de validation SHACL. 34es Journées francophones d'Ingénierie des Connaissances (IC 2023) @ Plate-Forme Intelligence Artificielle (PFIA 2023), Jul 2023, Strasbourg, France. ⟨hal-04152604⟩"
        },
        {
            "link": "https://hal.science/hal-01084444v1/document",
            "distinction": {
                "link": "",
                "type": ""
            },
            "title": "Testing OWL Axioms against RDF Facts: A Possibilistic Approach",
            "authors": [
                "Andrea G. B. Tettamanzi",
                "Catherine Faron",
                "Fabien Gandon"
            ],
            "keywords": [
                "Ontology Learning",
                "Open-World Assumption",
                "Possibility Theory"
            ],
            "conferenceTitle": "EKAW",
            "date": 2014,
            "place": "Linköping, Sweden",
            "abstract": "Automatic knowledge base enrichment methods rely criti-cally on candidate axiom scoring. The most popular scoring heuristics proposed in the literature are based on statistical inference. We argue that such a probability-based framework is not always completely satis-factory and propose a novel, alternative scoring heuristics expressed in terms of possibility theory, whereby a candidate axiom receives a bipolar score consisting of a degree of possibility and a degree of necessity. We evaluate our proposal by applying it to the problem of testing SubClassOf axioms against the DBpedia RDF dataset.",
            "citation": "Andrea G. B. Tettamanzi, Catherine Faron Zucker, Fabien Gandon. Testing OWL Axioms against RDF Facts: A Possibilistic Approach. Knowledge Engineering and Knowledge Management - 19th International Conference, EKAW 2014, Linköping, Sweden, November 24-28, 2014. Proceedings, Nov 2014, Linköping, Sweden. pp.519 - 530, ⟨10.1007/978-3-319-13704-9_39⟩. ⟨hal-01084444⟩"
        },
        {
            "link": "https://inria.hal.science/hal-01591001v1/document",
            "distinction": {
                "link": "",
                "type": ""
            },
            "title": "Possibilistic testing of OWL axioms against RDF data",
            "authors": [
                "Andrea G. B. Tettamanzi",
                "Catherine Faron",
                "Fabien Gandon"
            ],
            "keywords": [
                "Possibility Theory",
                "Linked Data",
                "Ontology Learning",
                "OWL 2",
                "Axioms"
            ],
            "conferenceTitle": "International Journal of Approximate Reasoning",
            "date": 2017,
            "place": "",
            "abstract": "We develop the theory of a possibilistic framework for OWL 2 axiom testing against RDF datasets, as an alternative to statistics-based heuristics. The intuition behind it is to evaluate the credibility of OWL 2 axioms based on the evidence available in the form of a set of facts contained in a chosen RDF dataset. To achieve it, we first define the notions of development, content, support , confirmation and counterexample of an axiom. Then we use these notions to define the possibility and necessity of an axiom and its acceptance/rejection index combining both of them. Finally, we report a practical application of the proposed framework to test SubClassOf axioms against the DBpedia RDF dataset.",
            "citation": "Andrea Tettamanzi, Catherine Faron Zucker, Fabien Gandon. Possibilistic testing of OWL axioms against RDF data. International Journal of Approximate Reasoning, 2017, ⟨10.1016/j.ijar.2017.08.012⟩. ⟨hal-01591001⟩"
        },
        {
            "link": "https://hal.science/hal-01187384v1/document",
            "distinction": {
                "link": "",
                "type": ""
            },
            "title": "Dynamically Time-Capped Possibilistic Testing of SubClassOf Axioms Against RDF Data to Enrich Schemas",
            "authors": [
                "Andrea G. B. Tettamanzi",
                "Catherine Faron",
                "Fabien Gandon"
            ],
            "keywords": [
                "Possibility Theory",
                "Open-World Assumption",
                "Ontology Learning"
            ],
            "conferenceTitle": "K-CAP",
            "date": 2015,
            "place": "Palisades, NY, United States",
            "abstract": "Axiom scoring is a critical task both for the automatic en-richment/learning and for the automatic validation of knowledge bases and ontologies. We designed and developed an axiom scoring heuristic based on possibility theory, which aims at overcoming some limitations of scoring heuristics based on statistical inference and taking into account the open-world assumption of the linked data on the Web. Since computing the possibilistic score can be computationally quite heavy for some candidate axioms, we propose a method based on time capping to alleviate the computation of the heuristic without giving up the precision of the scores. We evaluate our proposal by applying it to the problem of testing SubClassOf axioms against the DBpedia RDF dataset.",
            "citation": "Andrea G. B. Tettamanzi, Catherine Faron Zucker, Fabien Gandon. Dynamically Time-Capped Possibilistic Testing of SubClassOf Axioms Against RDF Data to Enrich Schemas. The 8th International Conference on Knowledge Capture, K-CAP 2015, Oct 2015, Palisades, NY, United States. ⟨10.1145/2815833.2815835⟩. ⟨hal-01187384⟩"
        },
        {
            "link": "https://inria.hal.science/hal-04031744v1/document",
            "distinction": {
                "link": "https://2023.eswc-conferences.org/best-paper-awards/",
                "type": "Best Research Track Paper"
            },
            "title": "A Framework to Include and Exploit Probabilistic Information in SHACL Validation Reports",
            "authors": [
                "Rémi Felin",
                "Catherine Faron",
                "Andrea G. B. Tettamanzi"
            ],
            "keywords": [
                "RDF",
                "SHACL",
                "Shape Testing",
                "Data Validation",
                "Probabilistic Assessment"
            ],
            "conferenceTitle": "ESWC",
            "date": 2023,
            "place": "Hersonissos, Greece",
            "abstract": "The Shapes Constraint Language (SHACL) is a W3C recommendation which allows to represent constraints in RDF-shape graphs-, and validate RDF data graphs against these constraints. A SHACL validator produces a validation report whose result is false for a shape graph as soon as there is at least one node in the RDF data graph that does not conform to the shape. This Boolean result of the validation of an RDF data graph against an RDF shape graph is not suitable for discovering new high-potential shapes from the RDF data. In this paper, we propose a probabilistic framework to accept shapes with a realistic proportion of nodes in an RDF data graph that does not conform to it. Based on this framework, we propose an extension of the SHACL validation report to express a set of metrics including the generality and likelihood of shapes and we define a method to test a shape as a hypothesis test. Finally, we present the results of experiments conducted to validate a test RDF data graph against a set of shapes.",
            "citation": "Rémi Felin, Catherine Faron, Andrea G. B. Tettamanzi. A Framework to Include and Exploit Probabilistic Information in SHACL Validation Reports. ESWC 2023 - 20th International European Semantic Web Conference, May 2023, Hersonissos, Greece. ⟨hal-04031744⟩"
        },
        {
            "link": "https://inria.hal.science/hal-03892080v1/document",
            "distinction": {
                "link": "",
                "type": ""
            },
            "title": "Optimizing the Computation of a Possibilistic Heuristic to Test OWL SubClassOf Axioms Against RDF Data",
            "authors": [
                "Rémi Felin",
                "Olivier Corby",
                "Catherine Faron",
                "Andrea G. B. Tettamanzi"
            ],
            "keywords": [
                "Knowledge Grapgs",
                "OWL Axioms",
                "Ontology Enrichment"
            ],
            "conferenceTitle": "WI-IAT",
            "date": 2022,
            "place": "Niagara Falls, Canada",
            "abstract": "The growth of the semantic Web requires tools to manage data, make them available to humans and for a wide range of applications. In particular, tools dedicated to ontology management are a keystone for semantic Web applications. In this paper we consider a possibilistic framework and an evolutionary approach for ontology enrichment with OWL axioms. The assessment of candidate OWL axioms against an RDF knowledge graph requires a high computational cost, especially in terms of computation time (CPU), which may limit the applicability of the framework. To answer this problem, our contribution presented in this paper consists of (i) a multi-threading system to parallelize axiom assessment, (ii) a heuristic to avoid redundant computation and (iii) an optimization for SPARQL query chunking relying on an extension of the SPARQL 1.1 Federated Query standard. The results of a comparative evaluation show that our proposal significantly outperforms the original algorithm, enabling a significant reduction in computation time.",
            "citation": "Rémi Felin, Olivier Corby, Catherine Faron, Andrea G. B. Tettamanzi. Optimizing the Computation of a Possibilistic Heuristic to Test OWL SubClassOf Axioms Against RDF Data. The 21st IEEE/WIC/ACM International Conference on Web Intelligence and Intelligent Agent Technology, Nov 2022, Niagara Falls, Canada. ⟨hal-03892080⟩"
        },
        {
            "link": "https://hal.science/hal-03519365v1/document",
            "distinction": {
                "link": "",
                "type": ""
            },
            "title": "Using Grammar-Based Genetic Programming for Mining Subsumption Axioms Involving Complex Class Expressions",
            "authors": [
                "Rémi Felin",
                "Andrea G. B. Tettamanzi"
            ],
            "keywords": [
                "Ontology Learning",
                "OWL Axioms",
                "Subsumption Axioms",
                "Grammatical Evolution"
            ],
            "conferenceTitle": "WI-IAT",
            "date": 2021,
            "place": "ESSENDON, VIC, Australia",
            "abstract": "Ontology enrichment is a key task in the area of the Semantic Web. It allows directly to enrich the links between entities of the semantic Web and thus adding information. Our research area is part of this objective with the search for axioms using an evolutionary process. We propose an adaptation resulting from the coupling between evolutionary algorithms and the theory of possibilities in order to allow the research of axioms of subsumption composed of complex classes.",
            "citation": "Rémi Felin, Andrea G. B. Tettamanzi. Using Grammar-Based Genetic Programming for Mining Subsumption Axioms Involving Complex Class Expressions. WI-IAT 2021 - 20th IEEE/WIC/ACM International Conference on Web Intelligence and Intelligent Agent Technology, Dec 2021, Melbourne, Australia. ⟨10.1145/3486622.3494025⟩. ⟨hal-03519365⟩"
        },
        {
            "link": "https://inria.hal.science/hal-02936253v1/document",
            "distinction": {
                "link": "",
                "type": ""
            },
            "title": "Grammatical Evolution to Mine OWL Disjointness Axioms Involving Complex Concept Expressions",
            "authors": [
                "Thu Huong Nguyen",
                "Andrea G. B. Tettamanzi"
            ],
            "keywords": [
                "Ontology Learning",
                "OWL Axioms",
                "Disjointness Axiom",
                "Grammatical Evolution"
            ],
            "conferenceTitle": "CEC",
            "date": 2020,
            "place": "Glasgow, UK",
            "abstract": "Discovering disjointness axioms is a very important task in ontology learning and knowledge base enrichment. To help overcome the knowledge-acquisition bottleneck, we propose a grammar-based genetic programming method for mining OWL class disjointness axioms from the Web of data. The effectiveness of the method is evaluated by sampling a large RDF dataset for training and testing the discovered axioms on the full dataset. First, we applied Grammatical Evolution to discover axioms based on a random sample of DBpedia, a large open knowledge graph consisting of billions of elementary assertions (RDF triples). Then, the discovered axioms are tested for accuracy on the whole DBpedia. We carried out experiments with different parameter settings and analyze output results as well as suggest extensions.",
            "citation": "Thu Huong Nguyen, Andrea G. B. Tettamanzi. Grammatical Evolution to Mine OWL Disjointness Axioms Involving Complex Concept Expressions. CEC 2020 - IEEE Congress on Evolutionary Computation, Jul 2020, Glasgow, United Kingdom. pp.1-8, ⟨10.1109/CEC48606.2020.9185681⟩. ⟨hal-02936253⟩"
        },
        {
            "link": "https://inria.hal.science/hal-02936193v1/document",
            "distinction": {
                "link": "",
                "type": ""
            },
            "title": "Using Grammar-Based Genetic Programming for Mining Disjointness Axioms Involving Complex Class Expressions",
            "authors": [
                "Thu Huong Nguyen",
                "Andrea G. B. Tettamanzi"
            ],
            "keywords": [
                "Ontology Learning",
                "OWL Axioms",
                "Disjointness Axiom",
                "Genetic Programming",
                "Grammatical Evolution"
            ],
            "conferenceTitle": "ICCS",
            "date": 2020,
            "place": "Bozen-Bolzano, Italy",
            "abstract": "In the context of the Semantic Web, learning implicit knowledge in terms of axioms from Linked Open Data has been the object of much current research. In this paper, we propose a method based on grammar-based genetic programming to automatically discover disjoint-ness axioms between concepts from the Web of Data. A training-testing model is also implemented to overcome the lack of benchmarks and comparable research. The acquisition of axioms is performed on a small sample of DBpedia with the help of a Grammatical Evolution algorithm. The accuracy evaluation of mined axioms is carried out on the whole DBpe-dia. Experimental results show that the proposed method gives high accuracy in mining class disjointness axioms involving complex expressions .",
            "citation": "Thu Huong Nguyen, Andrea G. B. Tettamanzi. Using Grammar-Based Genetic Programming for Mining Disjointness Axioms Involving Complex Class Expressions. ICCS 2020 - 25th International Conference on Conceptual Structures, Sep 2020, Bozen-Bolzano, Italy. pp.18-32, ⟨10.1007/978-3-030-57855-8_2⟩. ⟨hal-02936193⟩"
        },
        {
            "link": "https://inria.hal.science/hal-02319638v1/document",
            "distinction": {
                "link": "",
                "type": ""
            },
            "title": "An Evolutionary Approach to Class Disjointness Axiom Discovery",
            "authors": [
                "Thu Huong Nguyen",
                "Andrea G. B. Tettamanzi"
            ],
            "keywords": [
                "Ontology Learning",
                "Grammatical Evolution",
                "OWL Axioms"
            ],
            "conferenceTitle": "WI-IAT",
            "date": 2019,
            "place": "Thessaloniki, Greece",
            "abstract": "Axiom learning is an essential task in enhancing the quality of an ontology, a task that sometimes goes under the name of ontology enrichment. To overcome some limitations of recent work and to contribute to the growing library of ontology learning algorithms, we propose an evolutionary approach to automatically discover axioms from the abundant RDF data resource of the Semantic Web. We describe a method applying an instance of an Evolutionary Algorithm, namely Grammatical Evolution, to the acquisition of OWL class dis-jointness axioms, one important type of OWL axioms which makes it possible to detect logical inconsistencies and infer implicit information from a knowledge base. The proposed method uses an axiom scoring function based on possibility theory and is evaluated against a Gold Standard, manually constructed by knowledge engineers. Experimental results show that the given method possesses high accuracy and good coverage.",
            "citation": "Thu Huong Nguyen, Andrea G. B. Tettamanzi. An Evolutionary Approach to Class Disjointness Axiom Discovery. WI 2019 - IEEE/WIC/ACM International Conference on Web Intelligence, Oct 2019, Thessaloniki, Greece. pp.68-75, ⟨10.1145/3350546.3352502⟩. ⟨hal-02319638⟩"
        },
        {
            "link": "https://inria.hal.science/hal-03082579v1/document",
            "distinction": {
                "link": "",
                "type": ""
            },
            "title": "A Multi-Objective Evolutionary Approach to Class Disjointness Axiom Discovery",
            "authors": [
                "Thu Huong Nguyen",
                "Andrea G. B. Tettamanzi"
            ],
            "keywords": [
                "Genetic Programming",
                "Grammatical Evolution",
                "Multi-Objective Optimization",
                "Ontology Learning",
                "OWL Axioms",
                "Disjointness Axiom"
            ],
            "conferenceTitle": "WI-IAT",
            "date": 2020,
            "place": "Melbourne, Australia",
            "abstract": "The huge wealth of linked data available on the Web (also known as the Web of data), organized according to the standards of the Semantic Web, can be exploited to automatically discover new knowledge, expressed in the form of axioms, one of the essential components of ontologies. In order to overcome the limitations of existing methods for axiom discovery, we propose a two-objective grammar-based genetic programming approach that casts axiom discovery as a genetic programming problem involving the two independent criteria of axiom credibility and generality. We demonstrate the power of the proposed approach by applying it to the task of discovering class disjointness axioms involving complex class expression, a type of axioms that plays an important role in improving the quality of ontologies. We carry out experiments to determine the most appropriate parameter settings and we perform an empirical comparison of the proposed method with state-of-the-art methods proposed in the literature.",
            "citation": "Thu Huong Nguyen, Andrea G. B. Tettamanzi. A Multi-Objective Evolutionary Approach to Class Disjointness Axiom Discovery. WI-IAT 2020 - IEEE/WIC/ACM International Joint Conference on Web Intelligence and Intelligent Agent Technology, Dec 2020, Melbourne/ Virtual, Australia. ⟨hal-03082579⟩"
        },
        {
            "link": "https://inria.hal.science/hal-02100230v1/document",
            "distinction": {
                "link": "",
                "type": ""
            },
            "title": "Learning Class Disjointness Axioms Using Grammatical Evolution",
            "authors": [
                "Thu Huong Nguyen",
                "Andrea G. B. Tettamanzi"
            ],
            "keywords": [
                "Grammatical Evolution",
                "OWL Axioms",
                "Ontology Learning"
            ],
            "conferenceTitle": "EuroGP",
            "date": 2019,
            "place": "Leipzig, Germany",
            "abstract": "Today, with the development of the Semantic Web, Linked Open Data (LOD), expressed using the Resource Description Frame-work (RDF), has reached the status of “big data” and can be consideredas a giant data resource from which knowledge can be discovered. Theprocess of learning knowledge defined in terms of OWL 2 axioms fromthe RDF datasets can be viewed as a special case of knowledge discov-ery from data or “data mining”, which can be called “RDF mining”.The approaches to automated generation of the axioms from recordedRDF facts on the Web may be regarded as a case of inductive reasoningand ontology learning. The instances, represented by RDF triples, playthe role of specific observations, from which axioms can be extracted bygeneralization. Based on the insight that discovering new knowledge isessentially an evolutionary process, whereby hypotheses are generatedby some heuristic mechanism and then tested against the available evi-dence, so that only the best hypotheses survive, we propose the use ofGrammatical Evolution, one type of evolutionary algorithm, for miningdisjointness OWL 2 axioms from an RDF data repository such as DBpe-dia. For the evaluation of candidate axioms against the DBpedia dataset,we adopt an approach based on possibility theory.",
            "citation": "Thu Huong Nguyen, Andrea G B Tettamanzi. Learning Class Disjointness Axioms Using Grammatical Evolution. EuroGP 2019 - 22nd European Conference on Genetic Programming, Apr 2019, Leipzig, Germany. pp.278-294, ⟨10.1007/978-3-030-16670-0_18⟩. ⟨hal-02100230⟩"
        }
    ]
}